# CalculateStrokesPerArea Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..CalculateStrokesPerArea Method
FillGrid Class See Also
---
Calculates the number of the segments of the pattern per unit area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double CalculateStrokesPerArea()
```

Visual Basic
---
```text
Public Function CalculateStrokesPerArea As Double
```

Visual C++
---
```text
public:
double CalculateStrokesPerArea()
```

# ### Return Value
The strokes per area.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace